Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཞེས་ཤིན་དུ་རྣམ་པར་དག་པའི་ཆོས་སྟོན་པར་འགྱུར་རོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཤིན་དུ་རྣམ་པར་དག་གོ། ཞེས་ཤིན་དུ་རྣམ་པར་དག་པའི་ཆོས་སྟོན་པར་འགྱུར་རོ། །གསོལ་པ།
en: He will teach the Dharma of absolute purity, in that [the goals], up to and including all-aspect omniscience, are absolutely pure.” “

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཡོངས་སུ་དག་པའོ།
en: Blessed Lord, the perfection of wisdom is absolutely pure.” {Ki.

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ཡོངས་སུ་དག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: II-III: 179} “Subhūti,” replied the Blessed One, “the perfection of wisdom is absolutely pure owing to the absolute purity of physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: The perfection of wisdom is absolutely pure owing to the absolute purity of feelings, perceptions, formative predispositions, and consciousness.

source: །རབ་འབྱོར་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་དག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་།
en: Subhūti, the perfection of wisdom is absolutely pure owing to the absolute purity of the sense fields, the sensory elements, and the links of dependent origination.

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་དག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་།
en: The perfection of wisdom is absolutely pure owing to the absolute purity of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་དག་པའི་ཕྱིར།
en: The perfection of wisdom is absolutely pure owing to the absolute purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་དག་པའི་ཕྱིར།
en: The perfection of wisdom is absolutely pure owing to the absolute purity of the meditative stabilities and the dhāraṇī gateways.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་དག་པའི་ཕྱིར།
en: The perfection of wisdom is absolutely pure owing to the absolute purity of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: The perfection of wisdom is absolutely pure owing to the absolute purity of [the goals], up to and including all-aspect omniscience.” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་གཟུགས་ཡོངས་སུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: Blessed Lord, how is the perfection of wisdom absolutely pure owing to the absolute purity of physical forms?

source: ཇི་ལྟར་ན་ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: How is the perfection of wisdom absolutely pure owing to the absolute purity of feelings, perceptions, formative predispositions, and consciousness?

source: ཇི་ལྟར་ན་སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: How is the perfection of wisdom absolutely pure owing to the absolute purity of the sense fields, the sensory elements, and the links of dependent origination?

source: ཇི་ལྟར་ན་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས། ཇི་ལྟར་ན་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་།
en: How is the perfection of wisdom absolutely pure owing to the absolute purity of all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment?

source: ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: How is the perfection of wisdom absolutely pure owing to the absolute purity of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers?

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོངས་སུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས། ཇི་ལྟར་ན་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཡོངས་སུ་དག་པའི་སླད་དུ།
en: How is the perfection of wisdom absolutely pure owing to the absolute purity of the meditative stabilities and the dhāraṇī gateways?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས། ཇི་ལྟར་ན་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་དག་པའི་སླད་དུ།
en: How is the perfection of wisdom absolutely pure owing to the absolute purity of the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas?

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས། ཇི་ལྟར་ན་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་ཡོངས་སུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: How is the perfection of wisdom absolutely pure owing to the absolute purity of [the goals], up to and including all-aspect omniscience?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་གཟུགས་ཡོངས་སུ་དག་པའོ།
en: Subhūti,” replied the Blessed One, “physical forms are absolutely pure because they neither arise nor cease, and they are neither afflicted nor purified.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་རྣམ་པར་ཤེས་པ་ཡོངས་སུ་དག་པའོ།
en: Feelings, perceptions, formative predispositions, and consciousness are absolutely pure because they neither arise nor cease, and they are neither afflicted nor purified.

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡོངས་སུ་དག་པའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོངས་སུ་དག་པའོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་།
en: The sense fields, the sensory elements, and the links of dependent origination are absolutely pure because they neither arise nor cease, and they are neither afflicted nor purified.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་མངོན་པར་ཤེས་པ་ཡོངས་སུ་དག་པའོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are absolutely pure because they neither arise nor cease, and they are neither afflicted nor purified.

source: །ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་གཟུངས་ཀྱི་སྒོ་ཡོངས་སུ་དག་པའོ།
en: The meditative stabilities and the dhāraṇī gateways are absolutely pure because they neither arise nor cease, and they are neither afflicted nor purified.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོངས་སུ་དག་པའོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are absolutely pure because they neither arise nor cease, and they are neither afflicted nor purified. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡོངས་སུ་དག་པའོ།
en: The goals], up to and including all-aspect omniscience, are absolutely pure because they neither arise nor cease, and they are neither afflicted nor purified. “

source: །རབ་འབྱོར་གཞན་ཡང་ནམ་མཁའ་ཡོངས་སུ་དག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: Moreover, Subhūti, the perfection of wisdom is absolutely pure owing to the absolute purity of space.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ནམ་མཁའ་ཡོངས་སུ་དག་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: Blessed Lord, how is the perfection of wisdom absolutely pure owing to the absolute purity of space?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར་ནམ་མཁའ་ཡོངས་སུ་དག་པ་སྟེ།
en: Subhūti,” replied the Blessed One, “space is absolutely pure because it neither arises nor ceases, and it is neither afflicted nor purified.

source: རབ་འབྱོར་ནམ་མཁའ་ལ་འགྲོ་བ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: Subhūti, the perfection of wisdom is absolutely pure because space is unsullied.”{Ki.

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ནམ་མཁའ་ལ་འགྲོ་བ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: How is the perfection of wisdom absolutely pure owing to the unsullied nature of space?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ནམ་མཁའ་གཟུང་དུ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: Subhūti,” replied the Blessed One, “the perfection of wisdom is absolutely pure because space cannot be grasped.

source: །རབ་འབྱོར་ནམ་མཁའ་ལ་ཐ་སྙད་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །གསོལ་པ།
en: Subhūti, the perfection of wisdom is absolutely pure because space cannot be conventionally designated.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ནམ་མཁའ་ལ་ཐ་སྙད་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: Blessed Lord, how is the perfection of wisdom absolutely pure because space cannot be conventionally designated?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལྟ་སྟེ་དཔེར་ན། ནམ་མཁའི་སྒྲ་བརྙན་གཉིས་ཀྱི་སྒྲ་ལྟར། ནམ་མཁའ་ལ་ཐ་སྙད་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: Subhūti,” replied the Blessed One, “the perfection of wisdom is absolutely pure because space, like the resonance of a double echo in space, cannot be conventionally designated.

source: །རབ་འབྱོར་ནམ་མཁའ་བརྗོད་དུ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །གསོལ་པ།
en: Subhūti, the perfection of wisdom is absolutely pure because space is inexpressible.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ནམ་མཁའ་བརྗོད་དུ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: Blessed Lord, how is the perfection of wisdom absolutely pure because space is inexpressible?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ནམ་མཁའ་ལ་ནི་གང་ཡང་བརྗོད་དུ་མེད་དོ།
en: Subhūti,” replied the Blessed One, “in space, nothing at all is expressed.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་ནམ་མཁའ་བརྗོད་དུ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: In the same way, Subhūti, the perfection of wisdom is absolutely pure because space is inexpressible.

source: །རབ་འབྱོར་གཞན་ཡང་ནམ་མཁའ་དམིགས་སུ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: Moreover, Subhūti, the perfection of wisdom is absolutely pure because space is nonapprehensible.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ནམ་མཁའ་དམིགས་སུ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: Blessed Lord, how is the perfection of wisdom absolutely pure because space is nonapprehensible?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ནམ་མཁའ་ལ་གང་ཡང་དམིགས་སུ་མེད་དོ།
en: Subhūti,” replied the Blessed One, “in space, nothing at all is apprehended.

source: །རབ་འབྱོར་དེ་བཞིན་དུ་ནམ་མཁའ་དམིགས་སུ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ།
en: In the same way, Subhūti, the perfection of wisdom is absolutely pure because space is nonapprehensible.

source: །རབ་འབྱོར་གཞན་ཡང་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མེད་པ་དང་། འགག་པ་མེད་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མེད་པ་དང་། རྣམ་པར་བྱང་བ་མེད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །གསོལ་པ།
en: Moreover, Subhūti, the perfection of wisdom is absolutely pure because all phenomena neither arise nor cease, and are neither afflicted nor purified.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་ཆོས་ཐམས་ཅད་སྐྱེ་བ་མ་མཆིས་པ་དང་། འགག་པ་མ་མཆིས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་མ་མཆིས་པ་དང་། རྣམ་པར་བྱང་བ་མ་མཆིས་པའི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པ་ལགས།
en: Blessed Lord, how is the perfection of wisdom absolutely pure because all phenomena neither arise nor cease, and are neither afflicted nor purified?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་ཐམས་ཅད་ཤིན་དུ་རྣམ་པར་དག་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་དག་པའོ། །རབ་འབྱོར་གྱིས་གསོལ་པ། བཅོམ་ལྡན་འདས་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་པ་དང་།
en: Subhūti,” replied the Blessed One, “the perfection of wisdom is absolutely pure because all phenomena are utterly pure.” {

source: འཆང་བ་དང་། ཀློག་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བགྱིད་ན།
en: Ki.

source: བཅོམ་ལྡན་འདས་དེ་ལ་མིག་གི་ནད་འབྱུང་བར་མི་འགྱུར་རོ། །རྣ་བའི་ནད་དང་། སྣའི་ནད་དང་། ལྕེའི་ནད་དང་། ལུས་ཀྱི་ནད་དང་། ཡན་ལག་མ་ཚང་བར་མི་འགྱུར་རོ།
en: II-III: 181} Subhūti then said, “Blessed Lord, if any noble sons or noble daughters take up, uphold, recite, master, and focus their attention correctly on this profound perfection of wisdom, then, Blessed Lord, they will not suffer ailments of the eyes, nor will they suffer ailments of the ears, ailments of the nose, ailments of the tongue, or ailments of the body, nor will their limbs be defective, nor will their bodies be decrepit due to old age.

source: །ལུས་ངན་པར་མི་འགྱུར་རོ། །རྒས་པས་འཁོགས་པའི་ལུས་སུ་མི་འགྱུར་རོ། །རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་ནི་བདེ་བ་མི་སྤོངས་པས་དུས་བྱེད་པར་མི་འགྱུར་རོ།
en: Nor will those noble sons or noble daughters die a terrible death.

source: །དེའི་སླད་བཞིན་དུ་ལྷ་བརྒྱ་སྟོང་མང་པོ་འབྲང་བར་འགྱུར་ཏེ།
en: Many thousands of gods will purposefully follow them.

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། གནས་གཙང་མའི་རིས་ཀྱི་བར་གྱི་ལྷ་རྣམས་ཀྱང་སླད་བཞིན་དུ་འབྲང་བར་འགྱུར་རོ།
en: That is to say, the gods of the Caturmahā­rāja­kāyika realm and [those of the other realms], up to and including the gods of the Pure Abodes, will purposefully follow them.

source: །གང་ན་ཆོས་སྨྲ་བའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་སྟོན་པ་དེར་ཡང་། ཚེས་བརྒྱད་དང་། བཅུ་བཞི་དང་། བཅོ་ལྔ་དག་ལ་ལྷའི་ཚོགས་ཆེན་པོ་འདུ་བར་འགྱུར་རོ།
en: On the eighth day, the fourteenth day and the fifteenth day [of the lunar month], great hosts of the gods will congregate in places where those noble sons or noble daughters who teach the Dharma, reveal this perfection of wisdom.

source: །རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་སྟོན་པའི་ཚེ། བསོད་ནམས་མང་དུ་འཕེལ་བར་འགྱུར་ཏེ།
en: When those noble sons or noble daughters indeed reveal this perfection of wisdom, their merit will greatly increase.

source: རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་ཀྱི་ཕུང་པོ་རབ་ཏུ་མང་བ། ཚད་མ་མཆིས་པ། གྲངས་མ་མཆིས་པ་བསམ་གྱིས་མི་ཁྱབ་པ། མཚུངས་པ་མ་མཆིས་པ། གཞལ་དུ་མ་མཆིས་པ།
en: The stock of merit possessed by those noble sons or noble daughters will increase manifold and to an immeasurable, countless, inconceivable, incomparable, unappraisable, and inestimable extent.” “

source: དཔག་ཏུ་མ་མཆིས་པ།
en: Subhūti, it is so!

source: རབ་ཏུ་འཕེལ་བར་འགྱུར་རོ།
en: It is so!”

source: རབ་འབྱོར་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་གང་ཚེས་བརྒྱད་དང་། བཅུ་བཞི་དང་བཅོ་ལྔ་དག་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལྷའི་འཁོར་གྱི་མདུན་དུ་སྟོན་པའི་རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་དེའི་བསོད་ནམས་མང་དུ་འཕེལ་ཏེ།
en: The merit of those noble sons or noble daughters who reveal this perfection of wisdom on the eighth day, the fourteenth day and the fifteenth day [of the lunar month] before the assembly of gods will increase manifold.

source: བསོད་ནམས་ཀྱི་ཕུང་པོ་མང་པོ་དང་། ཚད་མེད་པ་གྲངས་མེད་པ། བསམ་གྱིས་མི་ཁྱབ་པ་མཚུངས་པ་མེད་པ་གཞལ་དུ་མེད་པ་དཔག་ཏུ་མེད་པ་རབ་ཏུ་འཕེལ་བར་འགྱུར་རོ།
en: Their stock of merit will increase manifold and to an immeasurable, countless, inconceivable, incomparable, unappraisable, and inestimable extent.

source: །རབ་འབྱོར་དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་རིན་པོ་ཆེའོ།
en: If you ask why, Subhūti, it is because this perfection of wisdom is most precious.

source: །རབ་འབྱོར་དེ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་རིན་པོ་ཆེ་ནི་འདི་ཡིན་ཏེ། སེམས་ཅན་དམྱལ་བ་ལས་ཡོངས་སུ་གྲོལ་བར་བྱེད་པའོ། །བྱོལ་སོང་གི་སྐྱེ་གནས་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་དང་། མི་དང་ལྷ་དབུལ་པོ་ལས་ཡོངས་སུ་གྲོལ་བར་བྱེད་པའོ།
en: Subhūti, the perfection of wisdom is precious in that it can liberate beings from the hells, and it can liberate them from the birthplaces of animals, the world of Yama, and the impoverished states of human beings and gods.

source: །རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་འབྱིན་པའོ། །བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་འབྱིན་པའོ། །ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་འབྱིན་པའོ། །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་སྐྱེ་བའི་སྐྱེ་མཆེད་འབྱིན་པའོ། །འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མྱིན་སྐྱེ་མཆེད་ཀྱི་བར་གྱི་ལྷའི་སྐྱེ་བའི་སྐྱེ་མཆེད་འབྱིན་པའོ།
en: It offers the prospects of rebirth in a great and lofty royal family, or in a great and lofty priestly family, or in a great and lofty householder family; and similarly, it offers the prospect of rebirth among the gods of the Caturmahā­rāja­kāyika realm, and it offers the prospects of rebirth among the gods [of other realms], up to and including the sphere of neither perception nor nonperception.

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་འབྱིན་པའོ།
en: It offers the fruit of entering the stream to nirvāṇa.

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་འབྱིན་པའོ།
en: It offers the fruit of being destined for only one more rebirth and the fruit of no longer being subject to rebirth.

source: །དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་འབྱིན་པའོ།
en: It offers arhatship and individual enlightenment.

source: །ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་འབྱིན་པའོ།
en: It offers complete enlightenment. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལས། དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་རྒྱས་པར་བསྟན་ཏེ།
en: If you ask why, it is because from this perfection of wisdom the paths of the ten virtuous actions is extensively revealed.

source: དེ་ལ་བསླབས་པས་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །བྲམ་ཟེའི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །ཁྱིམ་བདག་གི་རིགས་ཆེ་ཞིང་མཐོ་བ་རྣམས་ཡོད་དོ། །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཡོད་དོ། །སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཡོད་དོ། །ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་། སྣང་བ་དང་། ཆུང་སྣང་དང་། ཚད་མེད་སྣང་བ་དང་། ཀུན་སྣང་དང་བ་དང་། དགེ་བ་དང་། ཆུང་དགེ་དང་། ཚད་མེད་དགེ་བ་དང་། དགེ་རྒྱས་དང་། ཆེ་བ་དང་། ཆུང་ཆེ་བ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བ་དང་། མི་ཆེ་བ་དང་མི་གདུང་བ་དང་། ཤིན་དུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་།
en: Having trained in it, the great and lofty royal families are discerned; the great and lofty priestly families are discerned; the great and lofty householder families are discerned; the gods of the Caturmahā­rāja­kāyika realm are discerned; the gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms are discerned; the gods of Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, {Ki.

source: འོག་མྱིན་གྱི་ལྷ་རྣམས་ཡོད་དོ། །ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཡོད་དོ། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཆུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཡོད་དོ།
en: II-III: 182} Śubhakṛtsna, Bṛhat, Parīttabṛhat, Apramāṇabṛhat, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha are all discerned; the gods of the sphere of infinite space are discerned; and the gods of the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception are discerned. [

source: །རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ཡོད་དོ། །དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཡོད་དོ། །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཡོད་དོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཡོད་ན། བསམ་གཏན་བཞི་ཡོད་དོ། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་ཡོད་དོ། །བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡོད་དོ། །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོད་དོ། །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོད་དོ། །ནང་སྟོང་པ་ཉིད་ཡོད་དོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་ཡོད་དོ། །འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། རྣམ་པར་ཐར་པའི་སྒོ་གསུམ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཡོད་དོ། །ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་།
en: Having trained in it], the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, and the fruit of no longer being subject to rebirth are discerned, arhatship and individual enlightenment are discerned, and unsurpassed, complete enlightenment is discerned. “

source: གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ཡོད་དོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཡོད་དོ།
en: Also, if this perfection of wisdom is discerned, the thirty-seven factors conducive to enlightenment are discerned; the perfection of generosity is discerned; the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom are discerned; the emptiness of internal phenomena and [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, are discerned; the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, the three gateways to liberation, and the extrasensory powers are discerned; all the meditative stabilities and all the dhāraṇī gateways are discerned; the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas are discerned; and [all the goals], up to and including all-aspect omniscience, are discerned. “
